<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
  	<string>sgs-catalog</string>
	</array>
	<key>name</key>
	<string>munkireport</string>
	<key>display_name</key>
	<string>MunkiReport Install and Config</string>
	<key>installer_type</key>
	<string>nopkg</string>
	<key>installs</key>
	<array>
  	<dict>
		<key>path</key>
		<string>/usr/local/munki/munkireport-2.3.0</string>
		<key>type</key>
		<string>file</string>
  	</dict>
	</array>
	<key>preinstall_script</key>
	<string>#!/bin/bash 
/bin/bash -c "$(curl -s --max-time 10 http://munki-reports.seattlegirlsschool.org/index.php?/install)"</string>
	<key>minimum_os_version</key>
	<string>10.4.0</string>
	<key>unattended_install</key>
	<true/> 
	<key>uninstallable</key>
	<true/>
	<key>uninstall_method</key>
	<string>uninstall_script</string>
	<key>uninstall_script</key>
	<string>#!/bin/sh
rm -rf /usr/local/munki/preflight \
  /usr/local/munki/preflight.d \
  /usr/local/munki/postflight \
  /usr/local/munki/postflight.d \
  /usr/local/munki/report_broken_client \
  /usr/local/munkilib/reportcommon.py \
  /usr/local/munki/munkireport-* \
  /Library/Preferences/MunkiReport.plist
exit 0</string>
	<key>version</key>
	<string>2.3.0</string>
        <key>force_install_after_date</key>
        <date>2015-02-27T13:00:00Z</date>
</dict>
</plist>
